# DATAFRAME FÄ°LTRELEME

In [113]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [114]:
#data = ["A" ,"B" , "c"]
#pd.Series(data)

In [115]:
df = pd.DataFrame(randn(4,3) , ["A","B" , "C", "D"]  , ["Column1", "Column2" , "Column3"])

In [116]:
df

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [117]:
df > - 1 # filtreleme

   Column1  Column2  Column3
A     True    False     True
B     True     True     True
C     True     True     True
D     True     True     True

In [118]:
df > 0

   Column1  Column2  Column3
A     True    False     True
B    False    False     True
C     True     True     True
D     True     True     True

In [119]:
booleanDf = df >  0 # filtereleme(np arrayleri gibi )

In [120]:
booleanDf

   Column1  Column2  Column3
A     True    False     True
B    False    False     True
C     True     True     True
D     True     True     True

In [121]:
df[booleanDf]

    Column1   Column2   Column3
A  0.247202       NaN  0.594691
B       NaN       NaN  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [122]:
df[df > -2] #filtreleme

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [123]:
df["Column1"]

A    0.247202
B   -0.076777
C    0.507292
D    0.001871
Name: Column1, dtype: float64

In [124]:
df["Column1"] > 0

A     True
B    False
C     True
D     True
Name: Column1, dtype: bool

In [125]:
df[df["Column1"] > 0] #false olan deÄerler dahil edilmez

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [126]:
df[df["Column1"] > -1]

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [127]:
df

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [128]:
df[(df["Column1"] > -1) & (df["Column3"] > 0)]

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

DataFrame'e Yeni SÃ¼tun Ekleme YÃ¶ntemleri

ð1. YÃ¶ntem

In [131]:
df

    Column1   Column2   Column3
A  0.247202 -1.146280  0.594691
B -0.076777 -0.443283  1.107584
C  0.507292  0.159329  0.375711
D  0.001871  0.705978  0.201386

In [132]:
df["Column4"] = pd.Series(randn(4),index = ["A","B","C","D"])

In [133]:
df

    Column1   Column2   Column3   Column4
A  0.247202 -1.146280  0.594691 -0.543066
B -0.076777 -0.443283  1.107584 -0.261591
C  0.507292  0.159329  0.375711 -0.495659
D  0.001871  0.705978  0.201386  1.485362

2. YÃ¶ntem

In [135]:
df["Column5"] = randn(4)

In [136]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.247202 -1.146280  0.594691 -0.543066 -0.309720
B -0.076777 -0.443283  1.107584 -0.261591  1.335231
C  0.507292  0.159329  0.375711 -0.495659  1.114988
D  0.001871  0.705978  0.201386  1.485362  0.509344

# Set Index ve Indeksi DeÄiÅtirme

In [138]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.247202 -1.146280  0.594691 -0.543066 -0.309720
B -0.076777 -0.443283  1.107584 -0.261591  1.335231
C  0.507292  0.159329  0.375711 -0.495659  1.114988
D  0.001871  0.705978  0.201386  1.485362  0.509344

In [188]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [190]:
df

            Column1   Column2   Column3   Column4   Column5    Column6
Column6
newValue1  0.247202 -1.146280  0.594691 -0.543066 -0.309720  newValue1
newValue2 -0.076777 -0.443283  1.107584 -0.261591  1.335231  newValue2
newValue3  0.507292  0.159329  0.375711 -0.495659  1.114988  newValue3
newValue4  0.001871  0.705978  0.201386  1.485362  0.509344  newValue4

In [192]:
print(df.columns)

df.set_index("Column6") #index deÄerlerinin ismi Column6 oldu

Index(['Column1', 'Column2', 'Column3', 'Column4', 'Column5', 'Column6'], dtype='object')

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.247202 -1.146280  0.594691 -0.543066 -0.309720
newValue2 -0.076777 -0.443283  1.107584 -0.261591  1.335231
newValue3  0.507292  0.159329  0.375711 -0.495659  1.114988
newValue4  0.001871  0.705978  0.201386  1.485362  0.509344

In [194]:
df # DeÄiÅikliÄi geÃ§erli yapmak iÃ§in inplace parametresi gerekir.

            Column1   Column2   Column3   Column4   Column5    Column6
Column6
newValue1  0.247202 -1.146280  0.594691 -0.543066 -0.309720  newValue1
newValue2 -0.076777 -0.443283  1.107584 -0.261591  1.335231  newValue2
newValue3  0.507292  0.159329  0.375711 -0.495659  1.114988  newValue3
newValue4  0.001871  0.705978  0.201386  1.485362  0.509344  newValue4

In [196]:
 df.set_index("Column6",inplace = True)

In [198]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.247202 -1.146280  0.594691 -0.543066 -0.309720
newValue2 -0.076777 -0.443283  1.107584 -0.261591  1.335231
newValue3  0.507292  0.159329  0.375711 -0.495659  1.114988
newValue4  0.001871  0.705978  0.201386  1.485362  0.509344

In [176]:
df.index.names # Indekslerin ismi

FrozenList(['Column6'])

In [182]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.247202 -1.146280  0.594691 -0.543066 -0.309720
newValue2 -0.076777 -0.443283  1.107584 -0.261591  1.335231
newValue3  0.507292  0.159329  0.375711 -0.495659  1.114988
newValue4  0.001871  0.705978  0.201386  1.485362  0.509344